from django.shortcuts import render
from django.http import JsonResponse

from rest_framework import generics
from rest_framework.renderers import JSONRenderer
from rest_framework.views import APIView
from rest_framework.response import Response

"""
from .models import (

)
"""


class VacancyHeatMap(APIView):
    """Вакансии по регионам с hh"""

    renderer_classes = [JSONRenderer]

    def get(self, request):
        data = {
            'Россия': 105004,
            'Москва': 35815,
            'Санкт-Петербург': 12981,
            'Новосибирская область': 3642,
            'Свердловская область': 3529,
            'Краснодарский край': 3403,
            'Республика Татарстан ': 3344,
            'Московская область': 2760,
            'Нижегородская область': 2728,
            'Ростовская область': 2495,
            'Самарская область': 2227,
            'Воронеж область': 1989,
            'Пермский край ': 1581,
            'Челябинская область': 1414,
            'Республика Башкортостан': 1409,
            'Саратовская область': 1105,
            'Красноярский край': 1095,
            'Волгоградская область': 969,
            'Приморский край': 811,
            'Томская область': 809,
            'Удмурская республика': 807,
            'Ярославская область': 807,
            'Омская область': 800,
            'Тюменская область': 788,
            'Иркутская область': 780,
            'Ульяновская область': 744,
            'Кемеровская область': 739,
            'Тульская область': 709,
            'Алтайский край': 666,
            'Ставропольский край': 646,
            'Республика Крым': 574,
            'Калининградская область': 567,
            'Тверская область': 554,
            'Пензенская область': 527,
            'Владимирская область': 525,
            'Рязанская область': 514,
            'Хабаровкий край': 501,
            'Белгородская область': 497,
            'Калужская область': 491,
            'Чувашская Республика': 480,
            'Кировская область': 471,
            'Оренбургская область': 449,
            'Вологодская область': 428,
            'Ханты-Мансийский Автономный округ': 364,
            'Липецкая область': 356,
            'Ивановская область': 341,
            'Курская область': 331,
            'Харьковская область': 315,
            'Ленинградская область': 303,
            'Смоленская область': 290,
            'Брянская область': 287,
            'Республика Марий Эл': 267,
            'Тамбовская область': 258,
            'Орловская область': 256,
            'Костромская область': 239,
            'Республика Мордовия': 224,
            'Архангельская область': 218,
            'Астраханская область': 205,
            'Республика Дагестан': 182,
            'Курганская область': 180,
            'Амурская область': 163,
            'Новгородская область': 162,
            'Мурманская область': 162,
            'Ямало-Ненецкий АО': 162,
            'Республика Карелия ': 157,
            'Республика Коми': 153,
            'Псковская область': 141,
            'Республика Бурятия': 141,
            'Республика Саха': 119,
            'Забайкальский край': 111,
            'Республика Хакасия': 110,
            'Сахалинская область': 89,
            'Камчатский край': 78,
            'Республика Кабардино-Балкария ': 71,
            'Республика Северная Осетия - Аланяи ': 68,
            'Чеченская республика': 55,
            'Республикаа Карачаево-Черкесия ': 50,
            'Республика Адыгея': 48,
            'Республика Калмыкия': 48,
            'Республика Тыва ': 40,
            'Магаданская область': 33,
            'Республика Ингушетия ': 21,
            'Республика Алтай': 19,
            'Еврейская автономная область': 17,
            'Севастопольский регион ': 0
        }
        return Response(data=data)


class VacancyProcentHeatMap(APIView):
    """Вакансии с hh в процентах по IT"""

    renderer_classes = [JSONRenderer]

    def get(self, request):
        data = {
            'Россия': 100.0,
            'Москва': 34.10822444859243,
            'Санкт-Петербург': 12.362386194811627,
            'Новосибирская область': 3.46843929755057,
            'Свердловская область': 3.3608243495485883,
            'Краснодарский край': 3.240828920803017,
            'Республика Татарстан ': 3.184640585120567,
            'Московская область': 2.6284712963315684,
            'Нижегородская область': 2.597996266808883,
            'Ростовская область': 2.3760999580968343,
            'Самарская область': 2.1208715858443488,
            'Воронеж область': 1.89421355376938,
            'Пермский край ': 1.5056569273551483,
            'Челябинская область': 1.3466153670336367,
            'Республика Башкортостан': 1.3418536436707174,
            'Саратовская область': 1.0523408632052111,
            'Красноярский край': 1.0428174164793722,
            'Волгоградская область': 0.9228219877338005,
            'Приморский край': 0.7723515294655442,
            'Томская область': 0.7704468401203763,
            'Удмурская республика': 0.7685421507752086,
            'Ярославская область': 0.7685421507752086,
            'Омская область': 0.7618757380671213,
            'Тюменская область': 0.7504476019961144,
            'Иркутская область': 0.7428288446154432,
            'Ульяновская область': 0.7085444364024228,
            'Кемеровская область': 0.7037827130395032,
            'Тульская область': 0.6752123728619862,
            'Алтайский край': 0.6342615519408784,
            'Ставропольский край': 0.6152146584892004,
            'Республика Крым': 0.5466458420631595,
            'Калининградская область': 0.5399794293550723,
            'Тверская область': 0.5275989486114815,
            'Пензенская область': 0.5018856424517162,
            'Владимирская область': 0.49998095310654833,
            'Рязанская область': 0.4895051617081254,
            'Хабаровкий край': 0.4771246809645347,
            'Белгородская область': 0.4733153022741991,
            'Калужская область': 0.46760123423869565,
            'Чувашская Республика': 0.4571254428402728,
            'Кировская область': 0.44855434078701767,
            'Оренбургская область': 0.4276027579901718,
            'Вологодская область': 0.4076035198659098,
            'Ханты-Мансийский Автономный округ': 0.34665346082054016,
            'Липецкая область': 0.33903470343986897,
            'Ивановская область': 0.3247495333511104,
            'Курская область': 0.3152260866252714,
            'Харьковская область': 0.29998857186392897,
            'Ленинградская область': 0.2885604357929222,
            'Смоленская область': 0.27617995504933146,
            'Брянская область': 0.27332292103157974,
            'Республика Марий Эл': 0.2542760275799017,
            'Тамбовская область': 0.2457049255266466,
            'Орловская область': 0.2438002361814788,
            'Костромская область': 0.22761037674755247,
            'Республика Мордовия': 0.21332520665879395,
            'Архангельская область': 0.20761113862329053,
            'Астраханская область': 0.19523065787969981,
            'Республика Дагестан': 0.17332673041027008,
            'Курганская область': 0.17142204106510228,
            'Амурская область': 0.15523218163117594,
            'Новгородская область': 0.15427983695859207,
            'Мурманская область': 0.15427983695859207,
            'Ямало-Ненецкий АО': 0.15427983695859207,
            'Республика Карелия ': 0.14951811359567255,
            'Республика Коми': 0.14570873490533695,
            'Псковская область': 0.1342805988343301,
            'Республика Бурятия': 0.1342805988343301,
            'Республика Саха': 0.11332901603748428,
            'Забайкальский край': 0.10571025865681308,
            'Республика Хакасия': 0.10475791398422916,
            'Сахалинская область': 0.08475867585996724,
            'Камчатский край': 0.07428288446154432,
            'Республика Кабардино-Балкария ': 0.06761647175345702,
            'Республика Северная Осетия - Аланяи ': 0.0647594377357053,
            'Чеченская республика': 0.05237895699211458,
            'Республикаа Карачаево-Черкесия ': 0.04761723362919508,
            'Республика Адыгея': 0.045712544284027275,
            'Республика Калмыкия': 0.045712544284027275,
            'Республика Тыва ': 0.03809378690335606,
            'Магаданская область': 0.03142737419526875,
            'Республика Ингушетия ': 0.019999238124261933,
            'Республика Алтай': 0.01809454877909413,
            'Еврейская автономная область': 0.016189859433926326,
            'Севастопольский регион ': 0.0
        }
        return Response(data=data)


class VipuskHeatMap(APIView):
    """Список выпускников IT по России"""

    renderer_classes = [JSONRenderer]

    def get(self, request):
        data = {
            'Россия': 49652,
            'Москва': 19843,
            'Санкт-Петербург': 4337,
            'Новосибирская область': 958,
            'Свердловская область': 840,
            'Краснодарский край': 522,
            'Республика Татарстан ': 867,
            'Московская область': 759,
            'Нижегородская область': 678,
            'Ростовская область': 1315,
            'Самарская область': 1257,
            'Воронеж область': 931,
            'Пермский край ': 460,
            'Челябинская область': 848,
            'Республика Башкортостан': 1269,
            'Саратовская область': 626,
            'Красноярский край': 492,
            'Волгоградская область': 237,
            'Приморский край': 353,
            'Томская область': 399,
            'Удмурская республика': 266,
            'Ярославская область': 217,
            'Омская область': 448,
            'Тюменская область': 169,
            'Иркутская область': 326,
            'Ульяновская область': 128,
            'Кемеровская область': 400,
            'Тульская область': 250,
            'Алтайский край': 545,
            'Ставропольский край': 319,
            'Республика Крым': 220,
            'Калининградская область': 325,
            'Тверская область': 93,
            'Пензенская область': 732,
            'Владимирская область': 277,
            'Рязанская область': 46,
            'Хабаровкий край': 116,
            'Белгородская область': 152,
            'Калужская область': 57,
            'Чувашская Республика': 243,
            'Кировская область': 257,
            'Оренбургская область': 326,
            'Вологодская область': 181,
            'Ханты-Мансийский Автономный округ': 197,
            'Липецкая область': 64,
            'Ивановская область': 182,
            'Курская область': 439,
            'Харьковская область': 157,
            'Ленинградская область': 215,
            'Смоленская область': 147,
            'Брянская область': 339,
            'Республика Марий Эл': 221,
            'Тамбовская область': 275,
            'Орловская область': 310,
            'Костромская область': 111,
            'Республика Мордовия': 182,
            'Архангельская область': 226,
            'Астраханская область': 164,
            'Республика Дагестан': 317,
            'Курганская область': 60,
            'Амурская область': 83,
            'Новгородская область': 28,
            'Мурманская область': 128,
            'Ямало-Ненецкий АО': 376,
            'Республика Карелия ': 444,
            'Республика Коми': 125,
            'Псковская область': 96,
            'Республика Бурятия': 280,
            'Республика Саха': 127,
            'Забайкальский край': 68,
            'Республика Хакасия': 55,
            'Сахалинская область': 20,
            'Камчатский край': 13,
            'Республика Кабардино-Балкария ': 207,
            'Республика Северная Осетия - Аланяи ': 61,
            'Чеченская республика': 43,
            'Республикаа Карачаево-Черкесия ': 206,
            'Республика Адыгея': 175,
            'Республика Калмыкия': 21,
            'Республика Тыва ': 12,
            'Магаданская область': 18,
            'Республика Ингушетия ': 55,
            'Республика Алтай': 18,
            'Еврейская автономная область': 52,
            'Севастопольский регион ': 251
        }
        return Response(data=data)


class VipuskProcentHeatMap(APIView):
    """Распределение по выпускникам с профессией IT в процентах"""

    renderer_classes = [JSONRenderer]

    def get(self, request):
        data = {
            'Россия': 100.0,
            'Москва': 39.96415048739225,
            'Санкт-Петербург': 8.73479416740514,
            'Новосибирская область': 1.9294288246193507,
            'Свердловская область': 1.69177475227584,
            'Краснодарский край': 1.0513171674857005,
            'Республика Татарстан ': 1.7461532264561348,
            'Московская область': 1.5286393297349554,
            'Нижегородская область': 1.3655039071940707,
            'Ростовская область': 2.648433094336583,
            'Самарская область': 2.5316200757270604,
            'Воронеж область': 1.8750503504390559,
            'Пермский край ': 0.9264480786272458,
            'Челябинская область': 1.707886892773705,
            'Республика Башкортостан': 2.555788286473858,
            'Саратовская область': 1.2607749939579473,
            'Красноярский край': 0.9908966406187061,
            'Волгоградская область': 0.47732216224925483,
            'Приморский край': 0.7109481994682993,
            'Томская область': 0.803593007331024,
            'Удмурская республика': 0.5357286715540159,
            'Ярославская область': 0.43704181100459194,
            'Омская область': 0.902279867880448,
            'Тюменская область': 0.3403689680174011,
            'Иркутская область': 0.6565697252880045,
            'Ульяновская область': 0.25779424796584227,
            'Кемеровская область': 0.8056070248932571,
            'Тульская область': 0.5035043905582857,
            'Алтайский край': 1.0976395714170628,
            'Ставропольский край': 0.6424716023523726,
            'Республика Крым': 0.44308386369129144,
            'Калининградская область': 0.6545557077257713,
            'Тверская область': 0.18730363328768226,
            'Пензенская область': 1.4742608555546604,
            'Владимирская область': 0.5578828647385805,
            'Рязанская область': 0.09264480786272457,
            'Хабаровкий край': 0.23362603721904454,
            'Белгородская область': 0.3061306694594377,
            'Калужская область': 0.11479900104728914,
            'Чувашская Республика': 0.48940626762265366,
            'Кировская область': 0.5176025134939177,
            'Оренбургская область': 0.6565697252880045,
            'Вологодская область': 0.36453717876419883,
            'Ханты-Мансийский Автономный округ': 0.39676145975992905,
            'Липецкая область': 0.12889712398292114,
            'Ивановская область': 0.36655119632643196,
            'Курская область': 0.8841537098203496,
            'Харьковская область': 0.3162007572706034,
            'Ленинградская область': 0.4330137758801257,
            'Смоленская область': 0.296060581648272,
            'Брянская область': 0.6827519535970353,
            'Республика Марий Эл': 0.4450978812535245,
            'Тамбовская область': 0.5538548296141143,
            'Орловская область': 0.6243454442922742,
            'Костромская область': 0.22355594940787885,
            'Республика Мордовия': 0.36655119632643196,
            'Архангельская область': 0.45516796906469026,
            'Астраханская область': 0.3302988802062354,
            'Республика Дагестан': 0.6384435672279062,
            'Курганская область': 0.12084105373398855,
            'Амурская область': 0.16716345766535085,
            'Новгородская область': 0.056392491742528,
            'Мурманская область': 0.25779424796584227,
            'Ямало-Ненецкий АО': 0.7572706033996617,
            'Республика Карелия ': 0.8942237976315154,
            'Республика Коми': 0.25175219527914283,
            'Псковская область': 0.1933456859743817,
            'Республика Бурятия': 0.56392491742528,
            'Республика Саха': 0.2557802304036091,
            'Забайкальский край': 0.1369531942318537,
            'Республика Хакасия': 0.11077096592282286,
            'Сахалинская область': 0.04028035124466286,
            'Камчатский край': 0.026182228309030855,
            'Республика Кабардино-Балкария ': 0.4169016353822605,
            'Республика Северная Осетия - Аланяи ': 0.1228550712962217,
            'Чеченская республика': 0.08660275517602513,
            'Республикаа Карачаево-Черкесия ': 0.4148876178200274,
            'Республика Адыгея': 0.35245307339079995,
            'Республика Калмыкия': 0.04229436880689599,
            'Республика Тыва ': 0.024168210746797713,
            'Магаданская область': 0.03625231612019657,
            'Республика Ингушетия ': 0.11077096592282286,
            'Республика Алтай': 0.03625231612019657,
            'Еврейская автономная область': 0.10472891323612342,
            'Севастопольский регион ': 0.5055184081205188
        }
        return Response(data=data)


class ProficitDeficitHeatMap(APIView):
    """Профицитно-дефицитные отношения в регионе"""

    renderer_classes = [JSONRenderer]

    def get(self, request):
        data = {
            'Россия': -55352,
            'Москва': -15972,
            'Санкт-Петербург': -8644,
            'Новосибирская область': -2684,
            'Свердловская область': -2689,
            'Краснодарский край': -2881,
            'Республика Татарстан ': -2477,
            'Московская область': -2001,
            'Нижегородская область': -2050,
            'Ростовская область': -1180,
            'Самарская область': -970,
            'Воронеж область': -1058,
            'Пермский край ': -1121,
            'Челябинская область': -566,
            'Республика Башкортостан': -140,
            'Саратовская область': -479,
            'Красноярский край': -603,
            'Волгоградская область': -732,
            'Приморский край': -458,
            'Томская область': -410,
            'Удмурская республика': -541,
            'Ярославская область': -590,
            'Омская область': -352,
            'Тюменская область': -619,
            'Иркутская область': -454,
            'Ульяновская область': -616,
            'Кемеровская область': -339,
            'Тульская область': -459,
            'Алтайский край': -121,
            'Ставропольский край': -327,
            'Республика Крым': -354,
            'Калининградская область': -242,
            'Тверская область': -461,
            'Пензенская область': 205,
            'Владимирская область': -248,
            'Рязанская область': -468,
            'Хабаровкий край': -385,
            'Белгородская область': -345,
            'Калужская область': -434,
            'Чувашская Республика': -237,
            'Кировская область': -214,
            'Оренбургская область': -123,
            'Вологодская область': -247,
            'Ханты-Мансийский Автономный округ': -167,
            'Липецкая область': -292,
            'Ивановская область': -159,
            'Курская область': 108,
            'Харьковская область': -158,
            'Ленинградская область': -88,
            'Смоленская область': -143,
            'Брянская область': 52,
            'Республика Марий Эл': -46,
            'Тамбовская область': 17,
            'Орловская область': 54,
            'Костромская область': -128,
            'Республика Мордовия': -42,
            'Архангельская область': 8,
            'Астраханская область': -41,
            'Республика Дагестан': 135,
            'Курганская область': -120,
            'Амурская область': -80,
            'Новгородская область': -134,
            'Мурманская область': -34,
            'Ямало-Ненецкий АО': 214,
            'Республика Карелия ': 287,
            'Республика Коми': -28,
            'Псковская область': -45,
            'Республика Бурятия': 139,
            'Республика Саха': 8,
            'Забайкальский край': -43,
            'Республика Хакасия': -55,
            'Сахалинская область': -69,
            'Камчатский край': -65,
            'Республика Кабардино-Балкария ': 136,
            'Республика Северная Осетия - Аланяи ': -7,
            'Чеченская республика': -12,
            'Республикаа Карачаево-Черкесия ': 156,
            'Республика Адыгея': 127,
            'Республика Калмыкия': -27,
            'Республика Тыва ': -28,
            'Магаданская область': -15,
            'Республика Ингушетия ': 34,
            'Республика Алтай': -1,
            'Еврейская автономная область': 35,
            'Севастопольский регион ': 251
        }
        return Response(data=data)


class RegionDetailed(APIView):
    """Детальный просмотр по региону"""

    renderer_classes = [JSONRenderer]

    def get(self, request):
        data = {
            0: {
                "name": "Россия",
                "def_prof": -55352,
                "vipusk": 49652,
                "vacansy": 105004
            },
            1: {
                "name": "Москва",
                "def_prof": -15972,
                "vipusk": 19843,
                "vacansy": 35815
            },
            2: {
                "name": "Санкт-Петербург",
                "def_prof": -8644,
                "vipusk": 4337,
                "vacansy": 12981
            },
            3: {
                "name": "Новосибирская область",
                "def_prof": -2684,
                "vipusk": 958,
                "vacansy": 3642
            },
            4: {
                "name": "Свердловская область",
                "def_prof": -2689,
                "vipusk": 840,
                "vacansy": 3529
            },
            5: {
                "name": "Краснодарский край",
                "def_prof": -2881,
                "vipusk": 522,
                "vacansy": 3403
            },
            6: {
                "name": "Республика Татарстан ",
                "def_prof": -2477,
                "vipusk": 867,
                "vacansy": 3344
            },
            7: {
                "name": "Московская область",
                "def_prof": -2001,
                "vipusk": 759,
                "vacansy": 2760
            },
            8: {
                "name": "Нижегородская область",
                "def_prof": -2050,
                "vipusk": 678,
                "vacansy": 2728
            },
            9: {
                "name": "Ростовская область",
                "def_prof": -1180,
                "vipusk": 1315,
                "vacansy": 2495
            },
            10: {
                "name": "Самарская область",
                "def_prof": -970,
                "vipusk": 1257,
                "vacansy": 2227
            },
            11: {
                "name": "Воронеж область",
                "def_prof": -1058,
                "vipusk": 931,
                "vacansy": 1989
            },
            12: {
                "name": "Пермский край ",
                "def_prof": -1121,
                "vipusk": 460,
                "vacansy": 1581
            },
            13: {
                "name": "Челябинская область",
                "def_prof": -566,
                "vipusk": 848,
                "vacansy": 1414
            },
            14: {
                "name": "Республика Башкортостан",
                "def_prof": -140,
                "vipusk": 1269,
                "vacansy": 1409
            },
            15: {
                "name": "Саратовская область",
                "def_prof": -479,
                "vipusk": 626,
                "vacansy": 1105
            },
            16: {
                "name": "Красноярский край",
                "def_prof": -603,
                "vipusk": 492,
                "vacansy": 1095
            },
            17: {
                "name": "Волгоградская область",
                "def_prof": -732,
                "vipusk": 237,
                "vacansy": 969
            },
            18: {
                "name": "Приморский край",
                "def_prof": -458,
                "vipusk": 353,
                "vacansy": 811
            },
            19: {
                "name": "Томская область",
                "def_prof": -410,
                "vipusk": 399,
                "vacansy": 809
            },
            20: {
                "name": "Удмурская республика",
                "def_prof": -541,
                "vipusk": 266,
                "vacansy": 807
            },
            21: {
                "name": "Ярославская область",
                "def_prof": -590,
                "vipusk": 217,
                "vacansy": 807
            },
            22: {
                "name": "Омская область",
                "def_prof": -352,
                "vipusk": 448,
                "vacansy": 800
            },
            23: {
                "name": "Тюменская область",
                "def_prof": -619,
                "vipusk": 169,
                "vacansy": 788
            },
            24: {
                "name": "Иркутская область",
                "def_prof": -454,
                "vipusk": 326,
                "vacansy": 780
            },
            25: {
                "name": "Ульяновская область",
                "def_prof": -616,
                "vipusk": 128,
                "vacansy": 744
            },
            26: {
                "name": "Кемеровская область",
                "def_prof": -339,
                "vipusk": 400,
                "vacansy": 739
            },
            27: {
                "name": "Тульская область",
                "def_prof": -459,
                "vipusk": 250,
                "vacansy": 709
            },
            28: {
                "name": "Алтайский край",
                "def_prof": -121,
                "vipusk": 545,
                "vacansy": 666
            },
            29: {
                "name": "Ставропольский край",
                "def_prof": -327,
                "vipusk": 319,
                "vacansy": 646
            },
            30: {
                "name": "Республика Крым",
                "def_prof": -354,
                "vipusk": 220,
                "vacansy": 574
            },
            31: {
                "name": "Калининградская область",
                "def_prof": -242,
                "vipusk": 325,
                "vacansy": 567
            },
            32: {
                "name": "Тверская область",
                "def_prof": -461,
                "vipusk": 93,
                "vacansy": 554
            },
            33: {
                "name": "Пензенская область",
                "def_prof": 205,
                "vipusk": 732,
                "vacansy": 527
            },
            34: {
                "name": "Владимирская область",
                "def_prof": -248,
                "vipusk": 277,
                "vacansy": 525
            },
            35: {
                "name": "Рязанская область",
                "def_prof": -468,
                "vipusk": 46,
                "vacansy": 514
            },
            36: {
                "name": "Хабаровкий край",
                "def_prof": -385,
                "vipusk": 116,
                "vacansy": 501
            },
            37: {
                "name": "Белгородская область",
                "def_prof": -345,
                "vipusk": 152,
                "vacansy": 497
            },
            38: {
                "name": "Калужская область",
                "def_prof": -434,
                "vipusk": 57,
                "vacansy": 491
            },
            39: {
                "name": "Чувашская Республика",
                "def_prof": -237,
                "vipusk": 243,
                "vacansy": 480
            },
            40: {
                "name": "Кировская область",
                "def_prof": -214,
                "vipusk": 257,
                "vacansy": 471
            },
            41: {
                "name": "Оренбургская область",
                "def_prof": -123,
                "vipusk": 326,
                "vacansy": 449
            },
            42: {
                "name": "Вологодская область",
                "def_prof": -247,
                "vipusk": 181,
                "vacansy": 428
            },
            43: {
                "name": "Ханты-Мансийский Автономный округ",
                "def_prof": -167,
                "vipusk": 197,
                "vacansy": 364
            },
            44: {
                "name": "Липецкая область",
                "def_prof": -292,
                "vipusk": 64,
                "vacansy": 356
            },
            45: {
                "name": "Ивановская область",
                "def_prof": -159,
                "vipusk": 182,
                "vacansy": 341
            },
            46: {
                "name": "Курская область",
                "def_prof": 108,
                "vipusk": 439,
                "vacansy": 331
            },
            47: {
                "name": "Харьковская область",
                "def_prof": -158,
                "vipusk": 157,
                "vacansy": 315
            },
            48: {
                "name": "Ленинградская область",
                "def_prof": -88,
                "vipusk": 215,
                "vacansy": 303
            },
            49: {
                "name": "Смоленская область",
                "def_prof": -143,
                "vipusk": 147,
                "vacansy": 290
            },
            50: {
                "name": "Брянская область",
                "def_prof": 52,
                "vipusk": 339,
                "vacansy": 287
            },
            51: {
                "name": "Республика Марий Эл",
                "def_prof": -46,
                "vipusk": 221,
                "vacansy": 267
            },
            52: {
                "name": "Тамбовская область",
                "def_prof": 17,
                "vipusk": 275,
                "vacansy": 258
            },
            53: {
                "name": "Орловская область",
                "def_prof": 54,
                "vipusk": 310,
                "vacansy": 256
            },
            54: {
                "name": "Костромская область",
                "def_prof": -128,
                "vipusk": 111,
                "vacansy": 239
            },
            55: {
                "name": "Республика Мордовия",
                "def_prof": -42,
                "vipusk": 182,
                "vacansy": 224
            },
            56: {
                "name": "Архангельская область",
                "def_prof": 8,
                "vipusk": 226,
                "vacansy": 218
            },
            57: {
                "name": "Астраханская область",
                "def_prof": -41,
                "vipusk": 164,
                "vacansy": 205
            },
            58: {
                "name": "Республика Дагестан",
                "def_prof": 135,
                "vipusk": 317,
                "vacansy": 182
            },
            59: {
                "name": "Курганская область",
                "def_prof": -120,
                "vipusk": 60,
                "vacansy": 180
            },
            60: {
                "name": "Амурская область",
                "def_prof": -80,
                "vipusk": 83,
                "vacansy": 163
            },
            61: {
                "name": "Новгородская область",
                "def_prof": -134,
                "vipusk": 28,
                "vacansy": 162
            },
            62: {
                "name": "Мурманская область",
                "def_prof": -34,
                "vipusk": 128,
                "vacansy": 162
            },
            63: {
                "name": "Ямало-Ненецкий АО",
                "def_prof": 214,
                "vipusk": 376,
                "vacansy": 162
            },
            64: {
                "name": "Республика Карелия ",
                "def_prof": 287,
                "vipusk": 444,
                "vacansy": 157
            },
            65: {
                "name": "Республика Коми",
                "def_prof": -28,
                "vipusk": 125,
                "vacansy": 153
            },
            66: {
                "name": "Псковская область",
                "def_prof": -45,
                "vipusk": 96,
                "vacansy": 141
            },
            67: {
                "name": "Республика Бурятия",
                "def_prof": 139,
                "vipusk": 280,
                "vacansy": 141
            },
            68: {
                "name": "Республика Саха",
                "def_prof": 8,
                "vipusk": 127,
                "vacansy": 119
            },
            69: {
                "name": "Забайкальский край",
                "def_prof": -43,
                "vipusk": 68,
                "vacansy": 111
            },
            70: {
                "name": "Республика Хакасия",
                "def_prof": -55,
                "vipusk": 55,
                "vacansy": 110
            },
            71: {
                "name": "Сахалинская область",
                "def_prof": -69,
                "vipusk": 20,
                "vacansy": 89
            },
            72: {
                "name": "Камчатский край",
                "def_prof": -65,
                "vipusk": 13,
                "vacansy": 78
            },
            73: {
                "name": "Республика Кабардино-Балкария ",
                "def_prof": 136,
                "vipusk": 207,
                "vacansy": 71
            },
            74: {
                "name": "Республика Северная Осетия - Аланяи ",
                "def_prof": -7,
                "vipusk": 61,
                "vacansy": 68
            },
            75: {
                "name": "Чеченская республика",
                "def_prof": -12,
                "vipusk": 43,
                "vacansy": 55
            },
            76: {
                "name": "Республикаа Карачаево-Черкесия ",
                "def_prof": 156,
                "vipusk": 206,
                "vacansy": 50
            },
            77: {
                "name": "Республика Адыгея",
                "def_prof": 127,
                "vipusk": 175,
                "vacansy": 48
            },
            78: {
                "name": "Республика Калмыкия",
                "def_prof": -27,
                "vipusk": 21,
                "vacansy": 48
            },
            79: {
                "name": "Республика Тыва ",
                "def_prof": -28,
                "vipusk": 12,
                "vacansy": 40
            },
            80: {
                "name": "Магаданская область",
                "def_prof": -15,
                "vipusk": 18,
                "vacansy": 33
            },
            81: {
                "name": "Республика Ингушетия ",
                "def_prof": 34,
                "vipusk": 55,
                "vacansy": 21
            },
            82: {
                "name": "Республика Алтай",
                "def_prof": -1,
                "vipusk": 18,
                "vacansy": 19
            },
            83: {
                "name": "Еврейская автономная область",
                "def_prof": 35,
                "vipusk": 52,
                "vacansy": 17
            },
            84: {
                "name": "Севастопольский регион ",
                "def_prof": 251,
                "vipusk": 251,
                "vacansy": 0
            }
        }

        return Response(data=data)
